__all__ = ["KEYWORDS", "PATTERNS"]

KEYWORDS = {
    "fire": {
        "пожар", "огонь", "пламя",
        "возгорание", "загорание", "горение", "задымление",
        "возгораться", "загораться", "гореть", "выгореть",
        "пожарный", "огнеборец", "огнеборцы",
        "пожаротушение"
    },
    "traffic": {
        "дорожный - транспортный происшествие"
        "дорожный", "автомобиль"
    },
    "rescue": {
        "спасение", "спасатель", "спасать"
    },
    "drown": {
        "тонуть", "утонуть", "погружаться",
        "тонущий", "утопающий", "утопавший",
        "купание", "купания", "купаться"
    },
    "flood": {
        "паводок", "наводнение",
        "наводнило", "затопило"
    }
}

_l_city = [{"LEMMA": "населённый", "OP": "?"}, {"LEMMA": {"IN": ["город", "село", "посёлок", "пункт"]}}]
_l_name = [
    {"POS": "PROPN", "IS_TITLE": True},
    {"TEXT": "-", "OP": "?"}, {"POS": "PROPN", "OP": "?"},
    {"TEXT": "-", "OP": "?"}, {"POS": "PROPN", "OP": "?"}]

_l_reg = [{"LEMMA": {"IN": ["область", "республика", "край"]}}]
_l_reg_name = [{"POS": {"IN": ["ADJ", "PROPN"]}, "IS_TITLE": True}]

_l_inj = [
    {"LEMMA": {"IN":
                   ["пострадавший", "пострадавших", "пострадать", "страдать",
                    "погибнуть", "гибнуть",
                    "госпитализировать", "госпитализированный"
                    "утонуть"]
               }}]
_l_water = [{"LEMMA": {"IN": ["пруд", "река", "озеро", "водоём", "водохранилище", "море"]}}]

PATTERNS = {
    "city": [[*_l_city, *_l_name], [*_l_name, *_l_city], [{"TEXT": "г"}, {"TEXT": "."}, *_l_name]],
    "region": [[*_l_reg, *_l_reg_name], [*_l_reg_name, *_l_reg]],
    "injuries": [
        [{"POS": "NUM"}, {"POS": "NOUN", "OP": "?"}, *_l_inj],
        [*_l_inj, {"POS": "NUM"}, {"POS": "NOUN", "OP": "?"}],
        [{"LEMMA": {"IN": ["нет", "не"]}, "OP": "?"}, *_l_inj, {"LEMMA": {"IN": ["нет", "не"]}, "OP": "?"},
         {"POS": "NOUN", "OP": "?"}],
    ],
    "n_staff": [[
        {"POS": "NUM"}, {"LEMMA": {"IN": ["человек", "сотрудник", "пожарный", "спасатель"]}}
    ]],
    "n_tech": [[
        {"POS": "NUM"}, {"LEMMA": "единица", "OP": "?"},
        {"POS": "ADJ", "OP": "?"}, {"LEMMA": {"IN": ["техника", "машина"]}}
    ]],
    "area": [
        [
            {"POS": "NUM"},
            {"LEMMA": {"IN": ["кв", "квадратный"]}}, {"TEXT": ".", "OP": "?"},
            {"LEMMA": {"IN": ["метр", "километр"]}}
        ],
        [
            {"POS": "NUM"},
            {"LEMMA": {"IN": ["га", "гектар"]}}
        ]
    ],
    "water": [[*_l_water, *_l_name], [*_l_name, *_l_water]],
}
